tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
brew "bash-completion"
brew "dep"
brew "ffmpeg"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "glide"
brew "go"
brew "hub"
brew "hugo"
brew "insomniax"
brew "kubernetes-helm"
brew "kubetail"
brew "leiningen"
brew "mas"
brew "maven"
brew "mosquitto"
brew "node"
brew "stow"
brew "tree"
brew "watchman"
cask "adobe-illustrator-cc"
cask "adobe-photoshop-cc"
cask "alfred"
cask "atom"
cask "charles"
cask "docker"
cask "firefox"
cask "font-hasklig"
cask "github-desktop"
cask "gitify"
cask "google-cloud-sdk"
cask "grandperspective"
cask "hipchat"
cask "intellij-idea"
cask "iterm2"
cask "java"
cask "minikube"
cask "openemu"
cask "plex-media-server"
cask "rowanj-gitx"
cask "shiftit"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "xquartz"
cask "zeplin"
mas "Be Focused Pro", id: 961632517
mas "BreakTime", id: 427475982
mas "GarageBand", id: 682658836
mas "Transmit", id: 403388562
mas "Trello", id: 1278508951
