# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Color-highlighted diff(1) output
brew "colordiff"
# Modern, maintained replacement for ls
brew "eza"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Vi 'workalike' with many additional features
brew "vim"
# Display word differences between text files
brew "wdiff"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Command-line copy/paste utilities for Wayland
brew "wl-clipboard"
cask "font-hasklug-nerd-font"
vscode "amodio.tsl-problem-matcher"
vscode "anthropic.claude-code"
vscode "denoland.vscode-deno"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "expo.vscode-expo-tools"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "tamasfe.even-better-toml"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
