tap "oven-sh/bun"
# GitHub command-line tool
brew "gh"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Anthropic's official Claude AI desktop app
cask "claude"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
cask "font-hasklug-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Open-source code editor
cask "visual-studio-code"
vscode "amodio.tsl-problem-matcher"
vscode "anthropic.claude-code"
vscode "bradymholt.pgformatter"
vscode "connor4312.css-theme-completions"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "openai.chatgpt"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "richie5um2.vscode-sort-json"
vscode "softaware.abc-music"
vscode "spadin.zmk-tools"
vscode "stormwarning.json-template"
vscode "tamasfe.even-better-toml"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
